{"class_name": "Model", "config": {"name": "model_26", "layers": [{"name": "input_26", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 6], "dtype": "float32", "sparse": false, "name": "input_26"}, "inbound_nodes": []}, {"name": "bidirectional_26", "class_name": "Bidirectional", "config": {"name": "bidirectional_26", "trainable": true, "dtype": "float32", "layer": {"class_name": "GRU", "config": {"name": "gru_26", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "units": 60, "activation": "relu", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2, "reset_after": false}}, "merge_mode": "concat"}, "inbound_nodes": [[["input_26", 0, 0, {}]]]}, {"name": "dense_25", "class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["bidirectional_26", 0, 0, {}]]]}, {"name": "flatten_49", "class_name": "Flatten", "config": {"name": "flatten_49", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["dense_25", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "dtype": "float32", "activation": "softmax"}, "inbound_nodes": [[["flatten_49", 0, 0, {}]]]}, {"name": "repeat_vector_49", "class_name": "RepeatVector", "config": {"name": "repeat_vector_49", "trainable": true, "dtype": "float32", "n": 120}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "permute_49", "class_name": "Permute", "config": {"name": "permute_49", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["repeat_vector_49", 0, 0, {}]]]}, {"name": "multiply_24", "class_name": "Multiply", "config": {"name": "multiply_24", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["permute_49", 0, 0, {}], ["bidirectional_26", 0, 0, {}]]]}, {"name": "flatten_50", "class_name": "Flatten", "config": {"name": "flatten_50", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["multiply_24", 0, 0, {}]]]}, {"name": "sequence1", "class_name": "Dense", "config": {"name": "sequence1", "trainable": true, "dtype": "float32", "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_50", 0, 0, {}]]]}, {"name": "sequence", "class_name": "Dense", "config": {"name": "sequence", "trainable": true, "dtype": "float32", "units": 60, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["sequence1", 0, 0, {}]]]}, {"name": "repeat_vector_50", "class_name": "RepeatVector", "config": {"name": "repeat_vector_50", "trainable": true, "dtype": "float32", "n": 2}, "inbound_nodes": [[["sequence", 0, 0, {}]]]}, {"name": "permute_50", "class_name": "Permute", "config": {"name": "permute_50", "trainable": true, "dtype": "float32", "dims": [2, 1]}, "inbound_nodes": [[["repeat_vector_50", 0, 0, {}]]]}], "input_layers": [["input_26", 0, 0]], "output_layers": [["permute_50", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}